/******************************************************************************
 * 文件信息 : 
 * 
 * 创 建 者 :  
 *
 * 创建日期 : 
 * 
 * 原始版本 :  
 *     
 * 修改版本 :   
 *    
 * 修改日期 :  
 *
 * 修改内容 : 
 * 
 * 审 核 者 : 
 *
 * 附    注 : 
 *
 * 描    述 :   源代码
 *
 * 版    权 :   南京长盛仪器有限公司 , Copyright Reserved
 * 
******************************************************************************/

/******************************************************************************
 *                              头文件卫士
******************************************************************************/ 
 
#ifndef _DRV_PWM_H
#define _DRV_PWM_H

/******************************************************************************
 *                             包含文件声明
******************************************************************************/

#ifndef    _INCLUDES_H_
	#include    "../../../includes/includes.h"
#endif

/******************************************************************************
 *                           文件接口信息宏定义
******************************************************************************/

#define         DEVICE_NAME_PWM                         ("PWM")
#define		    PWM_IOC_RHREF_FORCE_H				    (DEVICE_IOC_USER+1)
#define		    PWM_IOC_RHREF_FORCE_L				    (DEVICE_IOC_USER+2)
#define		    PWM_IOC_HEAT_FORCE_H				    (DEVICE_IOC_USER+3)
#define		    PWM_IOC_HEAT_FORCE_L				    (DEVICE_IOC_USER+4)
//freq+duty
#define		    PWM_IOC_RHREF_FREQ				        (DEVICE_IOC_USER+5)
#define		    PWM_IOC_RHREF_DUTY_CYCLE				(DEVICE_IOC_USER+6)
#define		    PWM_IOC_HEAT_FREQ				        (DEVICE_IOC_USER+7)
#define		    PWM_IOC_HEAT_DUTY_CYCLE				    (DEVICE_IOC_USER+8)

struct pwm_ctrl{
    uint16                  m_freq;
    uint16                  m_duty_cycle;
};



/******************************************************************************
 *                            文件接口函数声明
******************************************************************************/ 

extern portuBASE_TYPE drv_pwmregister(void);

/******************************************************************************
 *                             END  OF  FILE                                                                          
******************************************************************************/

#endif
